![title](img/cover4.png)

<center><em>Copyright! This material is protected, please do not copy or distribute.    by:Taher Assaf</em></center>

***
<h1 align="center">Udemy course : Python Bootcamp for Data Science 2021 Numpy Pandas & Seaborn</h1> 

***

## 7.7 Arithmetic with Dataframe

First we import numpy and pandas

In [1]:
import numpy as np
import pandas as pd

Here we create a dataframe using the function **pd.DataFrame()**:

In [2]:
dt1 = pd.DataFrame(np.arange(1,13).reshape((3,4)), columns = ['a', 'b','c','d'])
dt1

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

Arithmetic operation can be done for the dataframe like this:

In [3]:
1 /dt1

          a         b         c         d
0  1.000000  0.500000  0.333333  0.250000
1  0.200000  0.166667  0.142857  0.125000
2  0.111111  0.100000  0.090909  0.083333

In [4]:
dt1.div(2)

     a    b    c    d
0  0.5  1.0  1.5  2.0
1  2.5  3.0  3.5  4.0
2  4.5  5.0  5.5  6.0

In [5]:
dt1.add(2)

    a   b   c   d
0   3   4   5   6
1   7   8   9  10
2  11  12  13  14

In [6]:
dt1.sub(2)

   a  b  c   d
0 -1  0  1   2
1  3  4  5   6
2  7  8  9  10

In [7]:
dt1.mul(2)

    a   b   c   d
0   2   4   6   8
1  10  12  14  16
2  18  20  22  24

In [8]:
dt1.pow(2)

    a    b    c    d
0   1    4    9   16
1  25   36   49   64
2  81  100  121  144

We can apply arithmetic operation to a single column like this:

In [9]:
dt1['a'].add(2)

0     3
1     7
2    11
Name: a, dtype: int32

We can also apply arithmetic operation to **specific rows** like this:

In [10]:
dt1.iloc[0].add(2)

a    3
b    4
c    5
d    6
Name: 0, dtype: int32

We can also do arithetic operation among columns:

In [11]:
dt1['d']- dt1['a']

0    3
1    3
2    3
dtype: int32

Statistics can be aslo calculated for the dataframe like this:

In [12]:
dt1.min()

a    1
b    2
c    3
d    4
dtype: int32

In [13]:
dt1.mean()

a    5.0
b    6.0
c    7.0
d    8.0
dtype: float64

We can calculate a group of statistics using the function **describe()**:

In [14]:
dt1.describe()

         a     b     c     d
count  3.0   3.0   3.0   3.0
mean   5.0   6.0   7.0   8.0
std    4.0   4.0   4.0   4.0
min    1.0   2.0   3.0   4.0
25%    3.0   4.0   5.0   6.0
50%    5.0   6.0   7.0   8.0
75%    7.0   8.0   9.0  10.0
max    9.0  10.0  11.0  12.0

Arithmetic operations can be aslo applied to statistics like this example:

In [15]:
dt1.max() - dt1.min()

a    8
b    8
c    8
d    8
dtype: int32

here is an example to normalize the data:

In [16]:
normalized_dt1 = (dt1-dt1.mean())/(dt1.max()-dt1.min())
normalized_dt1

     a    b    c    d
0 -0.5 -0.5 -0.5 -0.5
1  0.0  0.0  0.0  0.0
2  0.5  0.5  0.5  0.5

Here we create a series using the function **pd.Series()**:

In [17]:
ser1 = pd.Series(np.random.randint(1,50, size = 20))
ser1

0     16
1     49
2     42
3     49
4     20
5     12
6     12
7     38
8     11
9     22
10    33
11    40
12    16
13    21
14    34
15    28
16    33
17    19
18    37
19    24
dtype: int32

We can normalize the values in this series like this:

In [18]:
norm_ser1 = (ser1-ser1.mean())/(ser1.max()-ser1.min())
norm_ser1

0    -0.310526
1     0.557895
2     0.373684
3     0.557895
4    -0.205263
5    -0.415789
6    -0.415789
7     0.268421
8    -0.442105
9    -0.152632
10    0.136842
11    0.321053
12   -0.310526
13   -0.178947
14    0.163158
15    0.005263
16    0.136842
17   -0.231579
18    0.242105
19   -0.100000
dtype: float64

***

<h1 align="center">Thank You</h1> 

***